srjit/automated-plant-watering-psoc/Wi-Fi_Web_Server/source/web_server.c
/*******************************************************************************
* File Name: web_server.c
*
* Description: This file contains the necessary functions to configure the device 
*              in SoftAP mode and starts an HTTP server. The device can be 
*              provisioned to connect to an AP, after performing a scan for 
*              available APs, by using the credentials entered via HTTP client. 
*              Once the device is connected to AP, starts an HTTP server which 
*              processes GET and POST request from the HTTP client. 
*
********************************************************************************
* Copyright 2021-2023, Cypress Semiconductor Corporation (an Infineon company) or
* an affiliate of Cypress Semiconductor Corporation.  All rights reserved.
*
* This software, including source code, documentation and related
* materials ("Software") is owned by Cypress Semiconductor Corporation
* or one of its affiliates ("Cypress") and is protected by and subject to
* worldwide patent protection (United States and foreign),
* United States copyright laws and international treaty provisions.
* Therefore, you may use this Software only as provided in the license
* agreement accompanying the software package from which you
* obtained this Software ("EULA").
* If no EULA applies, Cypress hereby grants you a personal, non-exclusive,
* non-transferable license to copy, modify, and compile the Software
* source code solely for use in connection with Cypress's
* integrated circuit products.  Any reproduction, modification, translation,
* compilation, or representation of this Software except as specified
* above is prohibited without the express written permission of Cypress.
*
* Disclaimer: THIS SOFTWARE IS PROVIDED AS-IS, WITH NO WARRANTY OF ANY KIND,
* EXPRESS OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, NONINFRINGEMENT, IMPLIED
* WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE. Cypress
* reserves the right to make changes to the Software without notice. Cypress
* does not assume any liability arising out of the application or use of the
* Software or any product or circuit described in the Software. Cypress does
* not authorize its products for use in any products where a malfunction or
* failure of the Cypress product may reasonably be expected to result in
* significant property damage, injury or death ("High Risk Product"). By
* including Cypress's product in a High Risk Product, the manufacturer
* of such system or application assumes all risk of such use and in doing
* so agrees to indemnify Cypress against all liability.
*******************************************************************************/

/* Header file includes */
#include "cyhal.h"
#include "cybsp.h"
#include "cy_retarget_io.h"

/* FreeRTOS header file */
#include <FreeRTOS.h>
#include <task.h>

/* Secure Sockets header file */
#include "cy_secure_sockets.h"
#include "cy_tls.h"

/* Wi-Fi connection manager header files */
#include "cy_wcm.h"
#include "cy_wcm_error.h"

/* HTTP server task header file. */
#include "web_server.h"
#include "cy_http_server.h"
#include "cy_log.h"

/* Standard C header file */
#include <string.h>
#include <ctype.h>

/* HTTP server task header file. */
#include "cy_http_server.h"
#include "html_web_page.h"
#include "web_server.h"

/*******************************************************************************
* Global Variables
********************************************************************************/
static const cy_wcm_ip_setting_t ap_sta_mode_ip_settings =
{
    INITIALISER_IPV4_ADDRESS( .ip_address, SOFTAP_IP_ADDRESS),
    INITIALISER_IPV4_ADDRESS( .netmask,    SOFTAP_NETMASK),
    INITIALISER_IPV4_ADDRESS( .gateway,    SOFTAP_GATEWAY),
};

#ifdef ENABLE_TFT

/* Global variable to hold display row position. */
uint16_t row = TOP_DISPLAY;

/* Row value to print light sensor voltage on TFT display. */
uint16_t light_sensor_row_print = 0;

/* Row value to print duty cycle on TFT display. */
uint16_t duty_cycle_row_print = 0;

/* Light sensor object. */
extern mtb_light_sensor_t light_sensor_obj;

/* Pin mapping used in TFT display */
const mtb_st7789v_pins_t tft_pins =
{
    .db08 = CY8CKIT_028_TFT_PIN_DISPLAY_DB8,
    .db09 = CY8CKIT_028_TFT_PIN_DISPLAY_DB9,
    .db10 = CY8CKIT_028_TFT_PIN_DISPLAY_DB10,
    .db11 = CY8CKIT_028_TFT_PIN_DISPLAY_DB11,
    .db12 = CY8CKIT_028_TFT_PIN_DISPLAY_DB12,
    .db13 = CY8CKIT_028_TFT_PIN_DISPLAY_DB13,
    .db14 = CY8CKIT_028_TFT_PIN_DISPLAY_DB14,
    .db15 = CY8CKIT_028_TFT_PIN_DISPLAY_DB15,
    .nrd  = CY8CKIT_028_TFT_PIN_DISPLAY_NRD,
    .nwr  = CY8CKIT_028_TFT_PIN_DISPLAY_NWR,
    .dc   = CY8CKIT_028_TFT_PIN_DISPLAY_DC,
    .rst  = CY8CKIT_028_TFT_PIN_DISPLAY_RST
};
#endif

/* Holds the IP address and port number details of the socket for the HTTP server. */
cy_socket_sockaddr_t http_server_ip_address;

/* Pointer to HTTP event stream used to send device data to client. */
cy_http_response_stream_t* http_event_stream;

/* Wi-Fi network interface. */
cy_network_interface_t nw_interface;

/* HTTP server instance. */
cy_http_server_t http_ap_server;

/* HTTP server instance. */
cy_http_server_t http_sta_server;

/*Buffer to store SSID*/
uint8_t wifi_ssid[WIFI_SSID_LEN] = {0};

/*Buffer to store Password*/
uint8_t wifi_pwd[WIFI_PWD_LEN] = {0}; 

/*Buffer to store HTTP data*/
char buffer[BUFFER_LENGTH] = {0};

/* Holds the response handler for HTTP GET and POST request from the client 
* to implement Wi-Fi scan and Wi-Fi connect funtionality. 
*/
cy_resource_dynamic_data_t http_wifi_resource;

/* Flag to indicate if scan has completed.*/
volatile bool scan_complete_flag = false;

/* Flag to indicate if device has been configured. */
volatile bool device_configured = false;

/* Buffer to store ssid  */
static char ssid_buff[BUFFER_LENGTH];

/*Variable to indicate re-configuration request*/
volatile int8_t reconfiguration_request = 0;

/* Flag to indicate status of increase pwm value command. */
volatile bool increase_pwm = false;

/* Flag to indicate status of decrease pwm value command. */
volatile bool decrease_pwm = false;

