srjit/automated-plant-watering-psoc/Wi-Fi_Web_Server/source/web_server.c
typedef enum
{
    NO_PUMP,
	PUMP_1,
    PUMP_2,
    PUMP_3,
    PUMP_4
} pump_num_t;


volatile pump_num_t pump_action = NO_PUMP;

/* Array to store Wi-Fi connect response. */
static char http_wifi_connect_response[WIFI_CONNECT_RESPONSE_LENGTH] = {0};

/* Array to store Wi-Fi scan response. */
static char http_scan_response[MAX_WIFI_SCAN_HTTP_RESPONSE_LENGTH] = {0};

/*******************************************************************************
 * Function Name: process_sse_handler
 *******************************************************************************
 * Summary:
 *  Handler for enabling server sent events
 *
 * Parameters:
 *  url_path - Pointer to the HTTP URL path.
 *  url_parameters - Pointer to the HTTP URL query string.
 *  stream - Pointer to the HTTP response stream.
 *  arg - Pointer to the argument passed during HTTP resource registration.
 *  http_message_body - Pointer to the HTTP data from the client.
 *
 * Return:
 *  int32_t - Returns HTTP_REQUEST_HANDLE_SUCCESS if the request from the client
 *  was handled successfully. Otherwise, it returns HTTP_REQUEST_HANDLE_ERROR.
 *
 *******************************************************************************/
int32_t process_sse_handler( const char* url_path, const char* url_parameters,
                                   cy_http_response_stream_t* stream, void* arg,
                                   cy_http_message_body_t* http_message_body )
{
    cy_rslt_t result = CY_RSLT_SUCCESS;

    /* Assign the incoming stream to http_event_stream pointer */
    http_event_stream = stream;

    /* Enable chunked transfer encoding on the HTTP stream */
    result = cy_http_server_response_stream_enable_chunked_transfer( http_event_stream );
    PRINT_AND_ASSERT(result, "HTTP server event failed to enable chunked transfer\r\n");

    result = cy_http_server_response_stream_write_header( http_event_stream, CY_HTTP_200_TYPE,
                                                CHUNKED_CONTENT_LENGTH, CY_HTTP_CACHE_DISABLED,
                                                MIME_TYPE_TEXT_EVENT_STREAM );
    PRINT_AND_ASSERT(result, "HTTP server event failed to write stream header\r\n");

    return result;
}

/*******************************************************************************
 * Function Name: softap_resource_handler
 *******************************************************************************
 * Summary:
 *  Handles HTTP GET, POST, and PUT requests from the client.
 *  HTTP GET sends the HTTP startup webpage as a response to the client.
 *  HTTP POST extracts the credentials from the HTTP data from the client 
 *  and tries to connect to the AP.
 *  HTTP PUT sends an error message as a response to the client if the resource
 *  registration is unsuccessful.
 *
 * Parameters:
 *  url_path - Pointer to the HTTP URL path.
 *  url_parameters - Pointer to the HTTP URL query string.
 *  stream - Pointer to the HTTP response stream.
 *  arg - Pointer to the argument passed during HTTP resource registration.
 *  http_message_body - Pointer to the HTTP data from the client.
 *
 * Return:
 *  int32_t - Returns HTTP_REQUEST_HANDLE_SUCCESS if the request from the client
 *  was handled successfully. Otherwise, it returns HTTP_REQUEST_HANDLE_ERROR.
 *
 *******************************************************************************/
int32_t softap_resource_handler(const char *url_path,
                                 const char *url_parameters,
                                 cy_http_response_stream_t *stream,
                                 void *arg,
                                 cy_http_message_body_t *http_message_body)
{



    cy_rslt_t result = CY_RSLT_SUCCESS;
    int32_t status = HTTP_REQUEST_HANDLE_SUCCESS;

    switch (http_message_body->request_type)
    {
    case CY_HTTP_REQUEST_GET:

        /* If device is not configured send the initial page */
        if(!device_configured)
        {
            /* The start up page of the HTTP client will be sent as an initial response
             * to the GET request.
             */
            result = cy_http_server_response_stream_write_payload(stream, HTTP_SOFTAP_STARTUP_WEBPAGE, sizeof(HTTP_SOFTAP_STARTUP_WEBPAGE) - 1);
            if (CY_RSLT_SUCCESS != result)
            {
                ERR_INFO(("Failed to send the HTTP GET response.\r\n"));
            }
        }
        else
        {
            /* Send the data of the device */
            result = cy_http_server_response_stream_write_payload(stream, SOFTAP_DEVICE_DATA, sizeof(SOFTAP_DEVICE_DATA) - 1);
            if (CY_RSLT_SUCCESS != result)
            {
                ERR_INFO(("Failed to send the HTTP GET response.\n"));
            }
        }
        break;

    case CY_HTTP_REQUEST_POST:

        if(!device_configured)
        {
            /* The device tries to connect to the AP using the credentials sent via HTTP
             * webpage.
             */
            result = wifi_extract_credentials(http_message_body->data, http_message_body->data_length,stream);
        }
        else
        {
            /* Compare the input from client to increase or decrease pwm value. */
            if(!strncmp((char *)http_message_body->data, INCREASE, 8))
            {
                increase_pwm = true;
            }
            else if(!strncmp((char *)http_message_body->data, DECREASE, 8))
            {
                decrease_pwm = true;
            }

            else if(!strncmp((char *)http_message_body->data, PUMP1, 5))
			{
            	APP_INFO(("Pump1 command received\n"));
            	pump_action = PUMP_1;
			}
            else if(!strncmp((char *)http_message_body->data, PUMP2, 5))
			{
            	APP_INFO(("Pump2 command received\n"));
            	pump_action = PUMP_2;
			}
            else if(!strncmp((char *)http_message_body->data, PUMP3, 5))
			{
            	APP_INFO(("Pump3 command received\n"));
            	pump_action = PUMP_3;
			}
            else if(!strncmp((char *)http_message_body->data, PUMP4, 5))
			{
            	APP_INFO(("Pump4 command received\n"));
            	pump_action = PUMP_4;
			}


            /* Send the HTTP response. */
            result = cy_http_server_response_stream_write_payload(stream, HTTP_HEADER_204, sizeof(HTTP_HEADER_204) - 1);
            if (CY_RSLT_SUCCESS != result)
            {
                ERR_INFO(("Failed to send the HTTP POST response.\n"));
            }
        }
    break;

    default:
        ERR_INFO(("Received invalid HTTP request method. Supported HTTP methods are GET, POST, and PUT.\n"));
        
        break;

