srjit/automated-plant-watering-psoc/Wi-Fi_Web_Server/source/web_server.c
    }

    if (CY_RSLT_SUCCESS != result)
    {
        status = HTTP_REQUEST_HANDLE_ERROR;
    }

    return status;
}

/*******************************************************************************
 * Function Name: wifi_resource_handler
 *******************************************************************************
 * Summary:
 *  Handles HTTP GET, POST, and PUT requests from the client.
 *  HTTP GET performs scan for available networks(APs) and sends the list of 
 *  available networks as a response to the client.
 *  HTTP POST extracts the credentials from the HTTP data from the client 
 *  and tries to connect to the AP.
 *
 * Parameters:
 *  url_path - Pointer to the HTTP URL path.
 *  url_parameters - Pointer to the HTTP URL query string.
 *  stream - Pointer to the HTTP response stream.
 *  arg - Pointer to the argument passed during HTTP resource registration.
 *  http_message_body - Pointer to the HTTP data from the client.
 *
 * Return:
 *  int32_t - Returns HTTP_REQUEST_HANDLE_SUCCESS if the request from the client
 *  was handled successfully. Otherwise, it returns HTTP_REQUEST_HANDLE_ERROR.
 *
 *******************************************************************************/
static int32_t wifi_resource_handler(const char *url_path,
                                     const char *url_parameters,
                                     cy_http_response_stream_t *stream,
                                     void *arg,
                                     cy_http_message_body_t *http_message_body)
{
    cy_rslt_t result = CY_RSLT_SUCCESS;
    int32_t status = HTTP_REQUEST_HANDLE_SUCCESS;
    
    switch (http_message_body->request_type)
    {
    case CY_HTTP_REQUEST_GET:

        /* Scan for the available networks in response to the HTTP GET request. */
        scan_for_available_aps(stream);
        
        break;

    case CY_HTTP_REQUEST_POST:

        /* The device tries to connect to the AP using the credentials sent via HTTP
         * webpage.
         */
        result = cy_http_server_response_stream_write_payload(stream, HTTP_DEVICE_DATA_REDIRECT_WEBPAGE, sizeof(HTTP_DEVICE_DATA_REDIRECT_WEBPAGE));
        if (CY_RSLT_SUCCESS != result)
        {
            ERR_INFO(("Failed to send the HTTP POST response.\n"));
        }

        /* Set device configured flag to true */
        device_configured = true;
        reconfiguration_request = SERVER_RECONFIGURE_REQUESTED;
        cy_wcm_stop_ap();
        break;

    default:
        ERR_INFO(("Wi-Fi Scan: Received invalid HTTP request method. Supported HTTP methods are GET, POST, and PUT.\n"));
        
        break;

    }

    if (CY_RSLT_SUCCESS != result)
    {
        status = HTTP_REQUEST_HANDLE_ERROR;
    }

    return status;
}

/*******************************************************************************
 * Function Name: scan_callback
 *******************************************************************************
 * Summary: The callback function which accumulates the scan results. After
 * completing the scan, it updates scan_complete_flag to indicate end of scan.
 *
 * Parameters:
 *  cy_wcm_scan_result_t *result_ptr: Pointer to the scan result
 *  void *user_data: User data.
 *  cy_wcm_scan_status_t status: Status of scan completion.
 *
 * Return:
 *  void
 *
 ******************************************************************************/
void scan_callback(cy_wcm_scan_result_t *result_ptr, void *user_data, cy_wcm_scan_status_t status)
{
    char *network_name = ssid_buff;
    static uint32_t len = 0;
    
    if ((strlen((const char *)result_ptr->SSID) != 0) && (status == CY_WCM_SCAN_INCOMPLETE))
    {

        network_name += len;
        memcpy(network_name, result_ptr->SSID, strlen((char *)result_ptr->SSID));
        len += strlen((char *)result_ptr->SSID);
        memcpy((network_name + strlen((char *)result_ptr->SSID)), "\n", 1);
        len++;
        scan_complete_flag = false;
    }

    if ((CY_WCM_SCAN_COMPLETE == status))
    {
        /* Reset the number of scan results to 0 for the next scan.*/
        len++;
        memcpy((ssid_buff + len), "\0", 1);
        len = 0;
        
        /* Flag to notify that scan has completed.*/
        scan_complete_flag = true;        
    }

}

/*******************************************************************************
 * Function Name: scan_for_available_aps
 *******************************************************************************
 * Summary: This function scans for available APs and prints the scan result to 
 * the webpage once the scan is complete.
 *
 *
 * Parameters:
 *  cy_http_response_stream_t *url_stream : HTTP stream on which data was received.
 *
 * Return:
 *  void
 *
 ******************************************************************************/
void scan_for_available_aps(cy_http_response_stream_t *url_stream)
{
    cy_rslt_t result = CY_RSLT_SUCCESS;

    char *response = http_scan_response;

    result = cy_http_server_response_stream_write_payload(url_stream, WIFI_SCAN_IN_PROGRESS, sizeof(WIFI_SCAN_IN_PROGRESS));
    PRINT_AND_ASSERT(result, "Failed to send the HTTP POST response.\n");

    result = cy_wcm_start_scan(scan_callback, NULL, NULL);
    PRINT_AND_ASSERT(result, "cy_wcm_start_scan failed.\n");
    
    /* Waiting for the scan to be completed */
    while (!scan_complete_flag)
    {
        vTaskDelay(pdMS_TO_TICKS(SCAN_DELAY_MS));
    }

    scan_complete_flag = false;

    /* Print the scan result in webpage.*/
    sprintf(response, SOFTAP_SCAN_START_RESPONSE);
    response += strlen(SOFTAP_SCAN_START_RESPONSE);
    memcpy(response, ssid_buff, strlen(ssid_buff));
    response += strlen(ssid_buff);
    sprintf(response, SOFTAP_SCAN_INTERMEDIATE_RESPONSE);
    response += strlen(SOFTAP_SCAN_INTERMEDIATE_RESPONSE);
    sprintf(response, SOFTAP_SCAN_END_RESPONSE);
    response += strlen(SOFTAP_SCAN_END_RESPONSE); 
    
    result = cy_http_server_response_stream_write_payload(url_stream, http_scan_response, sizeof(http_scan_response) - 1);
    if (CY_RSLT_SUCCESS != result)
    {
        ERR_INFO(("Failed to write HTTP response\r\n"));
    }

