srjit/automated-plant-watering-psoc/Wi-Fi_Web_Server/source/web_server.c
}

/********************************************************************************
 * Function Name: wifi_extract_credentials
 ********************************************************************************
 * Summary:
 *  The function extracts the credentials entered via HTTP webpage. Switches to STA 
 *  mode then connects to the same credentials.
 *
 * Parameters:
 *  const uint8_t* data : The HTTP data that contains ssid and password that is
 *  entered from the HTTP webpage.
*   uint32_t data_len : The length of the HTTP response.
 *
 * Return:
 *  void
 *
 *******************************************************************************/
cy_rslt_t wifi_extract_credentials(const uint8_t *data, uint32_t data_len, cy_http_response_stream_t *stream)
{
    int8_t ssid_buff_index, buff_index = 0;
    cy_rslt_t result = CY_RSLT_SUCCESS;
    char *response = http_wifi_connect_response;

#ifdef ENABLE_TFT
    char display_buffer[DISPLAY_BUFFER_LENGTH] = {0};
#endif /* #ifdef ENABLE_TFT */

    /*decode the url encoded data using the function url_decode()*/
    url_decode(buffer, data);

    if (!strncmp("SSID", buffer, 4))
    {
        /* Extract SSID and Password - skip to SSID*/
        while ((buffer[buff_index++] != EQUALS_OPERATOR_ASCII_VALUE))
            ;

        ssid_buff_index = 0;
        /*skip '&' */
        while ((buffer[buff_index] != AMPERSAND_OPERATOR_ASCII_VALUE))
            wifi_ssid[ssid_buff_index++] = buffer[buff_index++];

        buff_index++;
        /* skip to Password */
        while ((buffer[buff_index++] != EQUALS_OPERATOR_ASCII_VALUE ))
            ;

        ssid_buff_index = 0;
        while ((buff_index < data_len))
        {
            if (buffer[buff_index] == AMPERSAND_OPERATOR_ASCII_VALUE)
                break;

            wifi_pwd[ssid_buff_index++] = buffer[buff_index++];
        }
    }
    result = cy_http_server_response_stream_write_payload(stream, WIFI_CONNECT_IN_PROGRESS, sizeof(WIFI_CONNECT_IN_PROGRESS));
    if (CY_RSLT_SUCCESS != result)
    {
        ERR_INFO(("Failed to send the HTTP POST response.\n"));
    }

    result = start_sta_mode();
    if (CY_RSLT_SUCCESS != result)
    {
        sprintf(response, WIFI_CONNECT_RESPONSE_START);
        response += strlen(WIFI_CONNECT_RESPONSE_START);
        sprintf(response, WIFI_CONNECT_FAIL_RESPONSE_END);
        response += strlen(WIFI_CONNECT_FAIL_RESPONSE_END);
        result = cy_http_server_response_stream_write_payload(stream, http_wifi_connect_response, sizeof(http_wifi_connect_response));
        if (CY_RSLT_SUCCESS != result)
        {
            ERR_INFO(("Failed to send the HTTP POST response.\n"));
        }
    }
    else
    {
        sprintf(response, WIFI_CONNECT_RESPONSE_START);
        response += strlen(WIFI_CONNECT_RESPONSE_START);
        sprintf(response, WIFI_CONNECT_SUCCESS_RESPONSE_END);
        response += strlen(WIFI_CONNECT_SUCCESS_RESPONSE_END);
        result = cy_http_server_response_stream_write_payload(stream, http_wifi_connect_response, sizeof(http_wifi_connect_response));
        if (CY_RSLT_SUCCESS != result)
        {
            ERR_INFO(("Failed to send the HTTP POST response.\n"));
        }

#ifdef ENABLE_TFT
    row += ROW_OFFSET;
    GUI_DispStringAt("Connected to the Wi-Fi network: \r\n", 0, row);
    row += ROW_OFFSET;
    sprintf(display_buffer, " %s\r\n", wifi_ssid);
    GUI_DispStringAt(display_buffer, 0, row);
    row += ROW_OFFSET;
#endif /* #ifdef ENABLE_TFT */

    }
    return result;
}

/********************************************************************************
 * Function Name: start_ap_mode
 ********************************************************************************
 * Summary:
 *  The function configures device in Concurrent AP + STA mode and initialises
 *  a SoftAP with the given credentials (SOFTAP_SSID, SOFTAP_PASSWORD and  security
 *  CY_WCM_SOFTAP_PASSWORD_WPA2_AES_PSK). 
 *
 * Parameters:
 *  void
 *
 * Return:
 *  cy_rslt_t: Returns CY_RSLT_SUCCESS if the SoftAP is started successfully,
 *  a WCM error code otherwise.
 *
 *******************************************************************************/
cy_rslt_t start_ap_mode()
{
    cy_rslt_t result;
    cy_wcm_ap_config_t ap_conf;
    cy_wcm_ip_address_t ipv4_addr;

    memset(&ap_conf, 0, sizeof(cy_wcm_ap_config_t));
    memset(&ipv4_addr, 0, sizeof(cy_wcm_ip_address_t));

    ap_conf.channel = 1;
    memcpy(ap_conf.ap_credentials.SSID, SOFTAP_SSID, strlen(SOFTAP_SSID) + 1);
    memcpy(ap_conf.ap_credentials.password, SOFTAP_PASSWORD, strlen(SOFTAP_PASSWORD) + 1);
    ap_conf.ap_credentials.security = SOFTAP_SECURITY_TYPE;
    ap_conf.ip_settings.ip_address = ap_sta_mode_ip_settings.ip_address;
    ap_conf.ip_settings.netmask = ap_sta_mode_ip_settings.netmask;
    ap_conf.ip_settings.gateway = ap_sta_mode_ip_settings.gateway;

    result = cy_wcm_start_ap(&ap_conf);
    PRINT_AND_ASSERT(result, "cy_wcm_start_ap failed...! \n");

    /* Get IPV4 address for AP */
    result = cy_wcm_get_ip_addr(CY_WCM_INTERFACE_TYPE_AP, &ipv4_addr);
    PRINT_AND_ASSERT(result, "cy_wcm_get_ip_addr failed...! \n");

    return result;
}

/*******************************************************************************
 * Function Name: start_sta_mode
 *******************************************************************************
 * Summary:
 *  The function attempts to connect to Wi-Fi until a connection is made or
 *  MAX_WIFI_RETRY_COUNT attempts have been made.
 * 
 * Parameters:
 *  void
 *
 * Return:
 *  cy_rslt_t: Returns CY_RSLT_SUCCESS if the HTTP server is configured
 *  successfully, otherwise, it returns CY_RSLT_TYPE_ERROR.
 *
 *******************************************************************************/
cy_rslt_t start_sta_mode()
{
    cy_rslt_t result;
    cy_wcm_connect_params_t connect_param;
    cy_wcm_ip_address_t ip_address;
    bool wifi_conct_stat = false;

    /*Disconnect from the currently connected AP if any*/
    wifi_conct_stat = cy_wcm_is_connected_to_ap();
    if(wifi_conct_stat)
    {
        cy_wcm_disconnect_ap();
    }

    memset(&connect_param, 0, sizeof(cy_wcm_connect_params_t));
    memset(&ip_address, 0, sizeof(cy_wcm_ip_address_t));
   
