srjit/automated-plant-watering-psoc/Wi-Fi_Web_Server/source/web_server.c
    memcpy(connect_param.ap_credentials.SSID, wifi_ssid, sizeof(wifi_ssid));
    memcpy(connect_param.ap_credentials.password, wifi_pwd, sizeof(wifi_pwd));
    connect_param.ap_credentials.security = CY_WCM_SECURITY_WPA2_AES_PSK;

    /* Attempt to connect to Wi-Fi until a connection is made or
     * MAX_WIFI_RETRY_COUNT attempts have been made.
     */
    for (uint32_t conn_retries = 0; conn_retries < MAX_WIFI_RETRY_COUNT; conn_retries++)
    {
        result = cy_wcm_connect_ap(&connect_param, &ip_address);
        if (result == CY_RSLT_SUCCESS)
        {
            APP_INFO(("Successfully connected to Wi-Fi network '%s'.\n", connect_param.ap_credentials.SSID));
            break;
        }
        ERR_INFO(("Connection to Wi-Fi network failed with error code %d. Retrying in %d ms...\n", (int)result, WIFI_CONN_RETRY_INTERVAL_MSEC));

        vTaskDelay(pdMS_TO_TICKS(WIFI_CONN_RETRY_INTERVAL_MSEC));
    }

    return result;
}

/*******************************************************************************
 * Function Name: configure_http_server
 *******************************************************************************
 * Summary:
 *  The function registers a softap_resource_handler to handle HTTP requests 
 *  received by http_ap_server. 
 *
 * Parameters:
 *  void
 *
 * Return:
 *  cy_rslt_t: Returns CY_RSLT_SUCCESS if the HTTP server is configured
 *  successfully, otherwise, it returns CY_RSLT_TYPE_ERROR.
 *
 *******************************************************************************/
cy_rslt_t configure_http_server(void)
{
    cy_rslt_t result = CY_RSLT_SUCCESS;
    cy_wcm_ip_address_t ip_addr;

    /* Holds the response handler for HTTP GET and POST request from the client. */
    cy_resource_dynamic_data_t http_get_post_resource;

    /* IP address of SoftAp. */
    result = cy_wcm_get_ip_addr(CY_WCM_INTERFACE_TYPE_AP, &ip_addr);
    PRINT_AND_ASSERT(result, "cy_wcm_get_ip_addr failed for creating HTTP server...! \n");

    http_server_ip_address.ip_address.ip.v4 = ip_addr.ip.v4;
    http_server_ip_address.ip_address.version = CY_SOCKET_IP_VER_V4;

    /* Add IP address information to network interface object. */
    nw_interface.object = (void *)&http_server_ip_address;
    nw_interface.type = CY_NW_INF_TYPE_WIFI;

    /* Initialize secure socket library. */
    result = cy_http_server_network_init();

    /* Allocate memory needed for secure HTTP server. */
    result = cy_http_server_create(&nw_interface, HTTP_PORT, MAX_SOCKETS, NULL, &http_ap_server);
    PRINT_AND_ASSERT(result, "Failed to allocate memory for the HTTP server.\n");

    /* Configure dynamic resource handler. */
    http_get_post_resource.resource_handler = softap_resource_handler;
    http_get_post_resource.arg = NULL;

    /* Register all the resources with the secure HTTP server. */
    result = cy_http_server_register_resource(http_ap_server,
                                              (uint8_t *)"/",
                                              (uint8_t *)"text/html",
                                              CY_DYNAMIC_URL_CONTENT,
                                              &http_get_post_resource);
    PRINT_AND_ASSERT(result, "Failed to register a resource.\n");

    /* Configure dynamic resource handler. */
    http_wifi_resource.resource_handler = wifi_resource_handler;
    http_wifi_resource.arg = NULL;

    /* Register all the resources with the secure HTTP server. */
    result = cy_http_server_register_resource(http_ap_server,
                                              (uint8_t *)"/wifi_scan_form",
                                              (uint8_t *)"text/html",
                                              CY_DYNAMIC_URL_CONTENT,
                                              &http_wifi_resource);
    PRINT_AND_ASSERT(result, "Failed to register a resource.\n");

    return result;
}

/*******************************************************************************
 * Function Name: reconfigure_http_server
 *******************************************************************************
 * Summary:
 * The function deletes the existing HTTP server instance (http_ap_server), and 
 * starts a new HTTP server instance (http_sta_server). After registering 
 * dynamic URL handler (process_sse_handler and http_get_post_resource) to handle 
 * the HTTP GET, POST, and PUT requests.
 *
 * Parameters:
 *  void
 *
 * Return:
 *  cy_rslt_t: Returns CY_RSLT_SUCCESS if the HTTP server is configured
 *  successfully, otherwise, it returns CY_RSLT_TYPE_ERROR.
 *
 *******************************************************************************/
cy_rslt_t reconfigure_http_server(void)
{
    cy_rslt_t result = CY_RSLT_SUCCESS;
    cy_wcm_ip_address_t ip_addr;

    /* Holds the response handler for HTTP GET and POST request from the client. */
    cy_resource_dynamic_data_t http_get_post_resource;

    /* Holds the response handler for dynamic SSE resource. */
    cy_resource_dynamic_data_t dynamic_sse_resource;

    /* Restart HTTP server using the new ip address. */
    result = cy_http_server_stop( http_ap_server );
    PRINT_AND_ASSERT(result, "Failed to stop HTTP server.\n");

    /* Delete the HTTP server object */
    result = cy_http_server_delete( http_ap_server );
    PRINT_AND_ASSERT(result, "Failed to delete HTTP server.\n");

    /* Deinitialize the network socket */
    result = cy_http_server_network_deinit();
    PRINT_AND_ASSERT(result, "Failed to deinit server.\n");

    /* IP address of SoftAp. */
    result = cy_wcm_get_ip_addr(CY_WCM_INTERFACE_TYPE_STA, &ip_addr);
    PRINT_AND_ASSERT(result, "cy_wcm_get_ip_addr failed for creating HTTP server...! \n");

    http_server_ip_address.ip_address.ip.v4 = ip_addr.ip.v4;
    http_server_ip_address.ip_address.version = CY_SOCKET_IP_VER_V4;

    /* Add IP address information to network interface object. */
    nw_interface.object = (void *)&http_server_ip_address;
    nw_interface.type = CY_NW_INF_TYPE_WIFI;

    /* Initialize secure socket library. */
    result = cy_http_server_network_init();

    /* Allocate memory needed for secure HTTP server. */
    result = cy_http_server_create(&nw_interface, HTTP_PORT, MAX_SOCKETS, NULL, &http_sta_server);
    PRINT_AND_ASSERT(result, "Failed to allocate memory for the HTTP server.\n");

