srjit/automated-plant-watering-psoc/Wi-Fi_Web_Server/source/web_server.c
    /* Configure server sent events*/
    dynamic_sse_resource.resource_handler = process_sse_handler;
    dynamic_sse_resource.arg = NULL;
    result = cy_http_server_register_resource( http_sta_server,
                                                (uint8_t*) "/events",
                                                (uint8_t*)"text/event-stream",
                                                CY_RAW_DYNAMIC_URL_CONTENT,
                                                &dynamic_sse_resource);
    PRINT_AND_ASSERT(result, "Failed to register a resource.\n");
    
    /* Configure dynamic resource handler. */
    http_get_post_resource.resource_handler = softap_resource_handler;
    http_get_post_resource.arg = NULL;

    /* Register all the resources with the secure HTTP server. */
    result = cy_http_server_register_resource(http_sta_server,
                                              (uint8_t *)"/",
                                              (uint8_t *)"text/html",
                                              CY_DYNAMIC_URL_CONTENT,
                                              &http_get_post_resource);
    PRINT_AND_ASSERT(result, "Failed to register a resource.\n");

    /* Start the HTTP server. */
    result = cy_http_server_start(http_sta_server);
    PRINT_AND_ASSERT(result, "Failed to start the HTTP server.\n");
   
    return result;
}

/*******************************************************************************
* Function Name: url_decode
********************************************************************************
*
* Summary:
* This function is used to decode the url encoded HTTP data received.
*
* Parameters:
* char* dst: Pointer to to whch decoded data should be copied.
* const uint8_t* src: Pointer to url encoded data .
*
* Return:
* void: Returns void .
*
*******************************************************************************/
void url_decode(char *dst, const uint8_t *src)
{
    char current_char, next_char;
    /* Ensure that the received character is a valid character. */
    while ((*src) && ((*src) < VALID_CHARACTER_ASCII_VALUE))
    {
        /* URL encoding replaces unsafe ASCII characters with a "%" followed 
         * by two hexadecimal digits. Check for character "%" followed by
         * two hexadecimal digits to decode unsafe ASCII characters.
         */
        if ((*src == MODUS_OPERATOR_ASCII_VALUE) && ((current_char = src[1]) && (next_char = src[2])) && (isxdigit(current_char) && isxdigit(next_char)))
        {
            if (current_char >= SMALL_LETTER_A_ASCII_VALUE)
            {
                current_char -= SMALL_LETTER_A_ASCII_VALUE - CAPITAL_LETTER_A_ASCII_VALUE;
            }
            if (current_char >= CAPITAL_LETTER_A_ASCII_VALUE)
            {
                current_char -= (CAPITAL_LETTER_A_ASCII_VALUE - LF_OPERATOR_ASCII_VALUE);
            }
            else
            {
                current_char -= NUMBER_ZERO_ASCII_VALUE;
            }
            if (next_char >= SMALL_LETTER_A_ASCII_VALUE)
            {
                next_char -= SMALL_LETTER_A_ASCII_VALUE - CAPITAL_LETTER_A_ASCII_VALUE;
            }
            if (next_char >= CAPITAL_LETTER_A_ASCII_VALUE)
            {
                next_char -= (CAPITAL_LETTER_A_ASCII_VALUE - LF_OPERATOR_ASCII_VALUE);
            }
            else
            {
                next_char -= NUMBER_ZERO_ASCII_VALUE ;
            }
            *dst++ = DLE_OPERATOR_ASCII_VALUE * current_char + next_char;
            src += URL_DECODE_ASCII_OFFSET_VALUE;
        }
        /* A space character is URL encoded as "+". Decode space character. */
        else if (*src == PLUS_OPERATOR_ASCII_VALUE)
        {
            *dst++ = SPACE_CHARACTER_ASCII_VALUE;
            src++;
        }
        /* Decode other characters. */
        else
        {
            *dst++ = *src++;
        }

    }

    *dst++ = NULL_CHARACTER_ASCII_VALUE;
    
}

/*******************************************************************************
* Macros
*******************************************************************************/

#define VPLUS_CHANNEL_0  (P10_0)
#define VPLUS_CHANNEL_1  (P10_3)
#define VPLUS_CHANNEL_2  (P10_2)
#define VPLUS_CHANNEL_3  (P10_1)

/* Number of scans every time ADC read is initiated */
#define NUM_SCAN                    (1)

/* Conversion factor */
#define MICRO_TO_MILLI_CONV_RATIO        (1000u)

/* Acquistion time in nanosecond */
#define ACQUISITION_TIME_NS              (1000u)

/* ADC Scan delay in millisecond */
#define ADC_SCAN_DELAY_MS                (500u)

/*******************************************************************************
*       Enumerated Types
*******************************************************************************/
/* ADC Channel constants*/
enum ADC_CHANNELS
{
  CHANNEL_0 = 0,
  CHANNEL_1,
  CHANNEL_2,
  CHANNEL_3,
  NUM_CHANNELS
} adc_channel;

/*******************************************************************************
* Global Variables
*******************************************************************************/
/* ADC Object */
cyhal_adc_t adc_obj;

/* ADC Channel 0 Object */
cyhal_adc_channel_t adc_chan_0_obj;
/* ADC Channel 1 Object */
cyhal_adc_channel_t adc_chan_1_obj;
/* ADC Channel 2 Object */
cyhal_adc_channel_t adc_chan_2_obj;
/* ADC Channel 3 Object */
cyhal_adc_channel_t adc_chan_3_obj;

/* Default ADC configuration */
const cyhal_adc_config_t adc_config = {
        .continuous_scanning=false, // Continuous Scanning is disabled
        .average_count=1,           // Average count disabled
        .vref=CYHAL_ADC_REF_VDDA,   // VREF for Single ended channel set to VDDA
        .vneg=CYHAL_ADC_VNEG_VSSA,  // VNEG for Single ended channel set to VSSA
        .resolution = 12u,          // 12-bit resolution
        .ext_vref = NC,             // No connection
        .bypass_pin = NC };       // No connection


/* Asynchronous read complete flag, used in Event Handler */
static bool async_read_complete = false;

