srjit/automated-plant-watering-psoc/Wi-Fi_Web_Server/source/web_server.c
/* Variable to store results from multiple channels during asynchronous read*/
int32_t result_arr[NUM_CHANNELS * NUM_SCAN] = {0};

/* Variable to store ADC conversion result from channel 0 */
int32_t adc_result[4] = {0};

/*******************************************************************************
 * Function Name: adc_event_handler
 *******************************************************************************
 *
 * Summary:
 *  ADC event handler. This function handles the asynchronous read complete event
 *  and sets the async_read_complete flag to true.
 *
 * Parameters:
 *  void *arg : pointer to result list
 *  cyhal_adc_event_t event : ADC event type
 *
 * Return:
 *  void
 *
 *******************************************************************************/
static void adc_event_handler(void* arg, cyhal_adc_event_t event)
{
    if(0u != (event & CYHAL_ADC_ASYNC_READ_COMPLETE))
    {
        /* Set async read complete flag to true */
        async_read_complete = true;
    }
}
/*******************************************************************************
 * Function Name: adc_multi_channel_init
 *******************************************************************************
 *
 * Summary:
 *  ADC Multichannel initilization. This function initializes and configures
 *  channel 0 and channel 1 of ADC.
 *
 * Parameters:
 *  void
 *
 * Return:
 *  void
 *
 *******************************************************************************/
void adc_multi_channel_init(void)
{
    /* Variable to capture return value of functions */
    cy_rslt_t result;

    /* Initialize ADC. The ADC block which can connect to the channel 0 input pin is selected */
    result = cyhal_adc_init(&adc_obj, VPLUS_CHANNEL_0, NULL);
    if(result != CY_RSLT_SUCCESS)
    {
        CY_ASSERT(0);
    }

    /* ADC channel configuration */
    const cyhal_adc_channel_config_t channel_config = {
            .enable_averaging = false,  // Disable averaging for channel
            .min_acquisition_ns = ACQUISITION_TIME_NS, // Minimum acquisition time set to 1us
            .enabled = true };          // Sample this channel when ADC performs a scan

    /* Initialize a channel 0 and configure it to scan the channel 0 input pin in single ended mode. */
    result  = cyhal_adc_channel_init_diff(&adc_chan_0_obj, &adc_obj, VPLUS_CHANNEL_0,
                                          CYHAL_ADC_VNEG, &channel_config);
    if(result != CY_RSLT_SUCCESS)
    {
        CY_ASSERT(0);
    }

    /* Initialize a channel 1 and configure it to scan the channel 1 input pin in single ended mode. */
    result = cyhal_adc_channel_init_diff(&adc_chan_1_obj, &adc_obj, VPLUS_CHANNEL_1,
            							  CYHAL_ADC_VNEG, &channel_config);
    if(result != CY_RSLT_SUCCESS)
    {
        CY_ASSERT(0);
    }

	 /* Initialize a channel 2 and configure it to scan the channel 2 input pin in single ended mode. */
	 result = cyhal_adc_channel_init_diff(&adc_chan_2_obj, &adc_obj, VPLUS_CHANNEL_2,
										  CYHAL_ADC_VNEG, &channel_config);
	 if(result != CY_RSLT_SUCCESS)
	 {
		 CY_ASSERT(0);
	 }


	 /* Initialize a channel 3 and configure it to scan the channel 3 input pin in single ended mode. */
	 result = cyhal_adc_channel_init_diff(&adc_chan_3_obj, &adc_obj, VPLUS_CHANNEL_3,
										  CYHAL_ADC_VNEG, &channel_config);
	 if(result != CY_RSLT_SUCCESS)
	 {
		 CY_ASSERT(0);
	 }

	 /* Register a callback to handle asynchronous read completion */
	  cyhal_adc_register_callback(&adc_obj, &adc_event_handler, result_arr);

	  /* Subscribe to the async read complete event to process the results */
	  cyhal_adc_enable_event(&adc_obj, CYHAL_ADC_ASYNC_READ_COMPLETE, CYHAL_ISR_PRIORITY_DEFAULT, true);
}


/*******************************************************************************
* Function Name: server_task
********************************************************************************
* Summary:
*  Task that initializes the device as SoftAp, and starts the HTTP server
*
* Parameters:
*  arg - Unused.
*
* Return:
*  None.
*
*******************************************************************************/
void server_task(void *arg)
{
    cy_rslt_t result = CY_RSLT_SUCCESS;
    (void)arg;

    /* Initialize pump GPIOs */
    cyhal_gpio_init(P5_7,CYHAL_GPIO_DIR_OUTPUT,CYHAL_GPIO_DRIVE_STRONG,1u);
    cyhal_gpio_init(P5_6,CYHAL_GPIO_DIR_OUTPUT,CYHAL_GPIO_DRIVE_STRONG,1u);
    cyhal_gpio_init(P5_5,CYHAL_GPIO_DIR_OUTPUT,CYHAL_GPIO_DRIVE_STRONG,1u);
    cyhal_gpio_init(P5_4,CYHAL_GPIO_DIR_OUTPUT,CYHAL_GPIO_DRIVE_STRONG,1u);

    /* Initialize ADC channels */
    adc_multi_channel_init();

	/* Update ADC configuration */
	result = cyhal_adc_configure(&adc_obj, &adc_config);
	if(result != CY_RSLT_SUCCESS)
	{
		CY_ASSERT(0);
	}


#define PUMP_ON_TIME (500u)
#define PUMP_1_PIN   (P5_4)
#define PUMP_2_PIN   (P5_5)
#define PUMP_3_PIN   (P5_6)
#define PUMP_4_PIN   (P5_7)

#ifdef ENABLE_TFT
    result = mtb_st7789v_init8(&tft_pins);
    CY_ASSERT(result == CY_RSLT_SUCCESS);

    uint8_t light_sensor_reading = 0;
    uint16_t light_sensor_voltage = 0;
#endif /* #ifdef ENABLE_TFT */

    uint8_t duty_cycle_reading = 0;
    char sensor_value_buffer[SENSOR_BUFFER_LENGTH];
    char http_response[MAX_HTTP_RESPONSE_LENGTH] = {0};

#ifdef ENABLE_TFT
    /*Initialize and setup TFT display */
    initialize_display();
#endif /* #ifdef ENABLE_TFT */

    /* Initialize the Wi-Fi device as a STA.*/
    cy_wcm_config_t config = {.interface = CY_WCM_INTERFACE_TYPE_AP_STA};
   
    /* Initialize the Wi-Fi device, Wi-Fi transport, and lwIP network stack.*/
    result = cy_wcm_init(&config);
    PRINT_AND_ASSERT(result,"cy_wcm_init failed...!\n");

    result = start_ap_mode();
   // PRINT_AND_ASSERT(result, "start SoftAP failed...!\n");

    result = configure_http_server();
    PRINT_AND_ASSERT(result, "Failed to configure the HTTP server...!\n");

    /* Start the HTTP server. */
    result = cy_http_server_start(http_ap_server);
    PRINT_AND_ASSERT(result, "Failed to start the HTTP server.\n");

    display_configuration();
    
    /* Waits for queue message to register a new HTTP page resource.*/
    while (true)
    {
        if(SERVER_RECONFIGURED == reconfiguration_request)
        {
            /* Process all widgets */
            result = Cy_CapSense_ProcessAllWidgets(&cy_capsense_context);
            if (CY_RSLT_SUCCESS != result)
            {
                ERR_INFO(("Failed to scan all widgets.\r\n"));
            }

            /* Process touch input */
            process_touch();

            /* Initiate next scan */
            result = Cy_CapSense_ScanAllWidgets(&cy_capsense_context);
            while(CY_CAPSENSE_BUSY == Cy_CapSense_IsBusy(&cy_capsense_context));

            if(decrease_pwm)
            {
                decrease_duty_cycle();
                decrease_pwm = false;

