srjit/automated-plant-watering-psoc/Wi-Fi_Web_Server/source/web_server.c
            }
            if(increase_pwm)
            {
                increase_duty_cycle();
                increase_pwm = false;
            }

            if(pump_action == PUMP_1)
            {
                cyhal_gpio_write(PUMP_1_PIN, 0u);
                vTaskDelay(PUMP_ON_TIME);
                cyhal_gpio_write(PUMP_1_PIN, 1u);

                pump_action = NO_PUMP;
            }

            if(pump_action == PUMP_2)
            {
                cyhal_gpio_write(PUMP_2_PIN, 0u);
                vTaskDelay(PUMP_ON_TIME);
                cyhal_gpio_write(PUMP_2_PIN, 1u);

                pump_action = NO_PUMP;
            }

            if(pump_action == PUMP_3)
            {
                cyhal_gpio_write(PUMP_3_PIN, 0u);
                vTaskDelay(PUMP_ON_TIME);
                cyhal_gpio_write(PUMP_3_PIN, 1u);

                pump_action = NO_PUMP;
            }

            if(pump_action == PUMP_4)
            {
                cyhal_gpio_write(PUMP_4_PIN, 0u);
                vTaskDelay(PUMP_ON_TIME);
                cyhal_gpio_write(PUMP_4_PIN, 1u);

                pump_action = NO_PUMP;
            }


            /*retrieve pwm value*/
            duty_cycle_reading = get_duty_cycle();

			/* Initiate an asynchronous read operation. The event handler will be called
			 * when it is complete. */
			result = cyhal_adc_read_async_uv(&adc_obj, NUM_SCAN, result_arr);
			if(result != CY_RSLT_SUCCESS)
			{
				CY_ASSERT(0);
			}

			/*
			 * Read data from result list, input voltage in the result list is in
			 * microvolts. Convert it millivolts and print input voltage
			 *
			 */
			adc_result[0] = result_arr[CHANNEL_0] / MICRO_TO_MILLI_CONV_RATIO;
			adc_result[1] = result_arr[CHANNEL_1] / MICRO_TO_MILLI_CONV_RATIO;
			adc_result[2] = result_arr[CHANNEL_2] / MICRO_TO_MILLI_CONV_RATIO;
			adc_result[3] = result_arr[CHANNEL_3] / MICRO_TO_MILLI_CONV_RATIO;

			APP_INFO(("Moisture Sns1:%d mV, Sns2:%d mV, Sns3:%d mV, Sns4:%d mV \n", adc_result[0],adc_result[1],adc_result[2],adc_result[3]));


			/* Clear async read complete flag */
			async_read_complete = false;

#ifdef ENABLE_TFT
           /*Calculate lightsensor voltage.*/
           light_sensor_reading = mtb_light_sensor_light_level(&light_sensor_obj);
           light_sensor_voltage = (uint32_t)((light_sensor_reading * LIGHTSENSOR_ADC_MAX_VOLTAGE) / LIGHTSENSOR_ADC_MAX_COUNT);
#endif /* #ifdef ENABLE_TFT */

#ifdef ENABLE_TFT
        /* Display data on LCD */
        sprintf(sensor_value_buffer, "%04d mV", light_sensor_voltage);
        GUI_DispStringAt(sensor_value_buffer, SENSOR_DISPLAY_OFFSET, light_sensor_row_print);
        sprintf(sensor_value_buffer, "%03d %%", duty_cycle_reading);
        GUI_DispStringAt(sensor_value_buffer, SENSOR_DISPLAY_OFFSET, duty_cycle_row_print);
#endif /* #ifdef ENABLE_TFT */

        /* Send the event stream with light sensor voltage and duty cycle */
        if( http_event_stream != NULL )
        {
#ifdef ENABLE_TFT
            sprintf(sensor_value_buffer, "Light Sensor Voltage: %dmV <br> PWM Duty Cycle: %d", light_sensor_voltage, duty_cycle_reading);

#else
            sprintf(sensor_value_buffer, "PWM Duty Cycle: %d, Moisture Sns1:%d mV, Sns2:%d mV, Sns3:%d mV, Sns4:%d mV \n", duty_cycle_reading,adc_result[0],adc_result[1],adc_result[2],adc_result[3]);

#endif /* #ifdef ENABLE_TFT */
            strcpy(http_response, (char*)sensor_value_buffer);

            /* Add event stream header */
            result = cy_http_server_response_stream_write_payload( http_event_stream, (const void*)EVENT_STREAM_DATA, sizeof( EVENT_STREAM_DATA ) - 1);
            if(result != CY_RSLT_SUCCESS){
                ERR_INFO(("Updating event stream failed"));
                http_event_stream = NULL;
            }

            /* Message to client */
            result = cy_http_server_response_stream_write_payload( http_event_stream, http_response, sizeof(http_response) - 1);
            if(result != CY_RSLT_SUCCESS){
                ERR_INFO(("Updating event stream failed"));
                http_event_stream = NULL;
            }

            /* SSE is ended with two line feeds */
            result = cy_http_server_response_stream_write_payload( http_event_stream, (const void*)LFLF, sizeof( LFLF ) - 1);
            if(result != CY_RSLT_SUCCESS){
                ERR_INFO(("Updating event stream failed\r\n"));
                http_event_stream = NULL;
            }
        }

           vTaskDelay(pdMS_TO_TICKS(500));

        }

        if(SERVER_RECONFIGURE_REQUESTED == reconfiguration_request)
        {
            reconfigure_http_server();
            display_configuration();
            initialize_sensors();
            reconfiguration_request = SERVER_RECONFIGURED;
        }

    }

}

#ifdef ENABLE_TFT
/*******************************************************************************
* Function Name: initialize_display
********************************************************************************
* Summary:
*  Task that initializes the TFT display and sets the foreground and background
*  colour.
*
* Parameters:
*  void
*
* Return:
*  void
*
*******************************************************************************/
void initialize_display(void)
{
    cy_rslt_t result = CY_RSLT_SUCCESS;

    /* Initialize TFT */
    result = GUI_Init();
    PRINT_AND_ASSERT(result, "Failed to initialize TFT\n");

    /* Set foreground and background color and font size */
    GUI_SetFont(GUI_FONT_13B_1);
    GUI_SetColor(GUI_WHITE);
    GUI_SetBkColor(GUI_BLACK);
    GUI_Clear();
}
#endif /* #ifdef ENABLE_TFT */

/*******************************************************************************
* Function Name: display_configuration
********************************************************************************
* Summary:
*  Displays details for configuring device on serial terminal and TFT screen.
*
* Parameters:
*  void
*
* Return:
*  void
*
*******************************************************************************/
void display_configuration(void)
{
    cy_wcm_ip_address_t ip_address;
    cy_rslt_t result = CY_RSLT_SUCCESS;

    uint32_t ip_addr;
    char display_ip_buffer[DISPLAY_BUFFER_LENGTH];
    char http_url[URL_LENGTH]={0};

#ifdef ENABLE_TFT
    char display_buffer[SENSOR_BUFFER_LENGTH];
#endif /* #ifdef ENABLE_TFT */

    if(reconfiguration_request == 0)
    {
        /* IP address of SoftAp. */
        result = cy_wcm_get_ip_addr(CY_WCM_INTERFACE_TYPE_AP, &ip_address);
        PRINT_AND_ASSERT(result, "Failed to retrieveSoftAP IP address\n");

        /*Print message to connect to that ip address*/
        ip_addr = ip_address.ip.v4;
        sprintf(display_ip_buffer, "%u.%u.%u.%u",  (unsigned char) ( ( ip_addr >> 0 ) & 0xff ),
                (unsigned char) ( ( ip_addr >> 8 ) & 0xff ),
                (unsigned char) ( ( ip_addr >> 16 ) & 0xff ),
                (unsigned char) ( ( ip_addr >> 24 ) & 0xff ));

        sprintf(http_url, "http://%s:%d", display_ip_buffer, HTTP_PORT);

        APP_INFO(("****************************************************************************\r\n"));
        APP_INFO(("Using another device, connect to the following Wi-Fi network:\r\n"));
        APP_INFO(("SSID     : %s\r\n", SOFTAP_SSID));
        APP_INFO(("Password : %s\r\n", SOFTAP_PASSWORD));
        APP_INFO(("Open a web browser of your choice and enter the URL %s\r\n", http_url));
        APP_INFO(("This opens up the the home page for web server application.\r\n"));
        APP_INFO(("You can either enter Wi-Fi network name and password directly or \r\n"));
        APP_INFO(("perform a Wi-Fi scan to get the list of available APs.\r\n"));
        APP_INFO(("****************************************************************************\r\n"));

#ifdef ENABLE_TFT
        /* Display instructions text */
        GUI_SetFont(GUI_FONT_16B_1);
        GUI_DispString("***Wi-Fi Web Server - Provisioning***");
        row +=ROW_OFFSET;
        GUI_SetFont(GUI_FONT_13B_1);
        GUI_DispStringAt("Using another device, connect to the following Wi-Fi \r\n", 0, row);
        row +=ROW_OFFSET;
        GUI_DispStringAt("network: \r\n", 0, row);
        row +=ROW_OFFSET;
        sprintf(display_buffer, "SSID: %s \r\n", SOFTAP_SSID);
        GUI_DispStringAt(display_buffer, 0, row);
        row +=ROW_OFFSET;
        sprintf(display_buffer, "Password: %s \r\n", SOFTAP_PASSWORD);
        GUI_DispStringAt(display_buffer, 0, row);
        row +=ROW_OFFSET;   
        GUI_DispStringAt("Open a web browser of your choice and enter the URL : \r\n", 0, row);
        row +=ROW_OFFSET;
        GUI_DispString(http_url);
        row +=ROW_OFFSET;
        GUI_DispStringAt("You can enter Wi-Fi network name and password directly ", 0, row);
        row +=ROW_OFFSET;
        GUI_DispStringAt("or perform a Wi-Fi scan to get the list of available APs.", 0, row);
#endif /* #ifdef ENABLE_TFT */
    }
    else
    {
        /*Variable to store associated AP informations. */
        cy_wcm_associated_ap_info_t associated_ap_info;
        /* IP address of STA. */
        result = cy_wcm_get_ip_addr(CY_WCM_INTERFACE_TYPE_STA, &ip_address);
        PRINT_AND_ASSERT(result, "Failed to retrieveSoftAP IP address\n");

        /*Print message to connect to that ip address*/
        ip_addr = ip_address.ip.v4;
        sprintf(display_ip_buffer, "%u.%u.%u.%u",  (unsigned char) ( ( ip_addr >> 0 ) & 0xff ),
                (unsigned char) ( ( ip_addr >> 8 ) & 0xff ),
                (unsigned char) ( ( ip_addr >> 16 ) & 0xff ),
                (unsigned char) ( ( ip_addr >> 24 ) & 0xff ));
                
        sprintf(http_url, "http://%s:%d", display_ip_buffer, HTTP_PORT);
        
