srjit/automated-plant-watering-psoc/Wi-Fi_Web_Server/source/web_server.c
        /*Get the associated AP informations. */
        cy_wcm_get_associated_ap_info(&associated_ap_info);

        /* \x1b[2J\x1b[;H - ANSI ESC sequence to clear screen. */
        APP_INFO(("\x1b[2J\x1b[;H"));
        APP_INFO(("******************************************************************\r\n"));
        APP_INFO(("On a device connected to the '%s' Wi-Fi network, \r\n", associated_ap_info.SSID));
        APP_INFO(("Open a web browser and go to : %s\r\n", http_url));
#ifdef ENABLE_TFT
        APP_INFO(("Use the webpage to observe the light sensor voltage.\r\n"));
#endif /* #ifdef ENABLE_TFT */
        APP_INFO(("Observe and vary the LED duty cycle from the webpage.\r\n"));
        APP_INFO(("******************************************************************\r\n"));

#ifdef ENABLE_TFT
        GUI_Clear();
        row = TOP_DISPLAY;
        GUI_SetFont(GUI_FONT_16B_1);
        GUI_DispString("***Wi-Fi Web Server - Device Data***");
        row += ROW_OFFSET;
        GUI_SetFont(GUI_FONT_13B_1);
        GUI_DispStringAt("On a device connected to the Wi-Fi network\r\n", 0, row);
        row += ROW_OFFSET;
        sprintf(display_buffer, "%s, \r\n", associated_ap_info.SSID);
        GUI_DispStringAt(display_buffer, 0, row);
        row += ROW_OFFSET;
        GUI_DispStringAt("open a web browser and go to : \r\n", 0, row);
        GUI_DispString(http_url);
        row += ROW_OFFSET;
        row += ROW_OFFSET;
        light_sensor_row_print = row;
        GUI_DispStringAt("Light Sensor Voltage", 0, row);
        row += ROW_OFFSET;
        row += ROW_OFFSET;
        duty_cycle_row_print = row;
        GUI_DispStringAt("PWM Duty Cycle", 0, row);
#endif /* #ifdef ENABLE_TFT */
    }
}

/* [] END OF FILE */
